In [ ]:
pip install openai

Collecting openai
  Downloading openai-1.51.0-py3-none-any.whl.metadata (24 kB)
Requirement already satisfied: anyio<5,>=3.5.0 in /usr/local/lib/python3.10/dist-packages (from openai) (3.7.1)
Requirement already satisfied: distro<2,>=1.7.0 in /usr/lib/python3/dist-packages (from openai) (1.7.0)
Collecting httpx<1,>=0.23.0 (from openai)
  Downloading httpx-0.27.2-py3-none-any.whl.metadata (7.1 kB)
Collecting jiter<1,>=0.4.0 (from openai)
  Downloading jiter-0.5.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (3.6 kB)
Requirement already satisfied: pydantic<3,>=1.9.0 in /usr/local/lib/python3.10/dist-packages (from openai) (2.9.2)
Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from openai) (1.3.1)
Requirement already satisfied: tqdm>4 in /usr/local/lib/python3.10/dist-packages (from openai) (4.66.5)
Requirement already satisfied: typing-extensions<5,>=4.11 in /usr/local/lib/python3.10/dist-packages (from openai) (4.12.2)
Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (3.10)
Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai) (1.2.2)
Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->openai) (2024.8.30)
Collecting httpcore==1.* (from httpx<1,>=0.23.0->openai)
  Downloading httpcore-1.0.6-py3-none-any.whl.metadata (21 kB)
Collecting h11<0.15,>=0.13 (from httpcore==1.*->httpx<1,>=0.23.0->openai)
  Downloading h11-0.14.0-py3-none-any.whl.metadata (8.2 kB)
Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (0.7.0)
Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic<3,>=1.9.0->openai) (2.23.4)
Downloading openai-1.51.0-py3-none-any.whl (383 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 383.5/383.5 kB 5.6 MB/s eta 0:00:00
Downloading httpx-0.27.2-py3-none-any.whl (76 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 76.4/76.4 kB 3.1 MB/s eta 0:00:00
Downloading httpcore-1.0.6-py3-none-any.whl (78 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 78.0/78.0 kB 4.2 MB/s eta 0:00:00
Downloading jiter-0.5.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (318 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 318.9/318.9 kB 17.8 MB/s eta 0:00:00
Downloading h11-0.14.0-py3-none-any.whl (58 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 58.3/58.3 kB 2.4 MB/s eta 0:00:00
Installing collected packages: jiter, h11, httpcore, httpx, openai
Successfully installed h11-0.14.0 httpcore-1.0.6 httpx-0.27.2 jiter-0.5.0 openai-1.51.0

In [ ]:
import psycopg2
from sqlalchemy import create_engine, text, Table, MetaData

from google.colab import userdata
# userdata.get('openAI_key')

Connect to Timescale DB

In [ ]:
conn_string = userdata.get('connection_string')
engine = create_engine(conn_string)

In [ ]:
drop_queries = [
    "DROP TABLE IF EXISTS Schedule;",
    "DROP TABLE IF EXISTS Student;",
    "DROP TABLE IF EXISTS Teacher;",
    "DROP TABLE IF EXISTS Course;",
    "DROP TABLE IF EXISTS Person;"
]

with engine.connect() as conn:
  for drop_query in drop_queries:
    conn.execute(text(drop_query))
  conn.commit()

Create Tables

In [ ]:
create_table_sql = """
    CREATE TABLE Person (
        id SERIAL PRIMARY KEY,
        name VARCHAR(30) NOT NULL,
        phone_number VARCHAR(15)
    );

    CREATE TABLE Teacher (
        id INTEGER PRIMARY KEY,
        rate NUMERIC(4, 2) NOT NULL,
        FOREIGN KEY (id) REFERENCES Person(id) ON DELETE CASCADE
    );

    CREATE TABLE Student (
        id INTEGER PRIMARY KEY,
        skill_level INTEGER DEFAULT 1,
        FOREIGN KEY (id) REFERENCES Person(id) ON DELETE CASCADE
    );

    CREATE TABLE Course (
        courseID SERIAL PRIMARY KEY,
        courseName VARCHAR(100) NOT NULL,
        skillLevel VARCHAR(50)
    );

    CREATE TABLE Schedule (
        studentID INTEGER,
        teacherID INTEGER,
        courseID INTEGER,
        MeetingTime TIME,
        MeetingDay VARCHAR(10),
        PRIMARY KEY (studentID, teacherID, courseID),
        FOREIGN KEY (studentID) REFERENCES Student(id) ON DELETE CASCADE,
        FOREIGN KEY (teacherID) REFERENCES Teacher(id) ON DELETE CASCADE,
        FOREIGN KEY (courseID) REFERENCES Course(courseID) ON DELETE CASCADE
    );


  """

In [ ]:
with engine.connect() as conn:
  conn.execute(text(create_table_sql))
  conn.commit()

Insert Data

In [ ]:
inserts = [
    'insert into person (id, name, phone_number)'
]

In [ ]:
person_data = [
    (1, 'Alice Johnson', '555-1234'),   # Teacher
    (2, 'Bob Smith', '555-5678'),       # Teacher
    (3, 'Charlie Davis', '555-8765'),   # Teacher
    (4, 'Dana White', '555-4321'),      # Teacher
    (5, 'Evelyn Carter', '555-2468'),    # Teacher
    (6, 'Frank Thompson', '555-1357'),   # Teacher
    (7, 'Grace Lee', '555-9876'),        # Teacher
    (8, 'Hank Miller', '555-6543'),      # Teacher
    (9, 'Ivy Nguyen', '555-7890'),       # Teacher
    (10, 'Jack Brown', '555-3210'),      # Teacher
    (11, 'Lily Adams', '555-4567'),      # Student
    (12, 'Mark Wilson', '555-7654'),     # Student
    (13, 'Nina Patel', '555-2345'),       # Student
    (14, 'Oscar Lee', '555-8760'),        # Student
    (15, 'Paula Kim', '555-1359'),        # Student
    (16, 'Quinn Brooks', '555-2589'),     # Student
    (17, 'Ryan Scott', '555-8521'),       # Student
    (18, 'Sophie Chen', '555-9630'),      # Student
    (19, 'Tina Rogers', '555-1478'),      # Student
    (20, 'Victor Gray', '555-3698')       # Student
]



teacher_data = [
    (1, 35.00),  # Alice Johnson
    (2, 40.00),  # Bob Smith
    (3, 42.50),  # Charlie Davis
    (4, 38.75),  # Dana White
    (5, 45.00),  # Evelyn Carter
    (6, 50.00),  # Frank Thompson
    (7, 37.50),  # Grace Lee
    (8, 39.25),  # Hank Miller
    (9, 41.00),  # Ivy Nguyen
    (10, 36.80)  # Jack Brown
]


student_data = [
    (11, 3),  # Lily Adams
    (12, 2),  # Mark Wilson
    (13, 1),  # Nina Patel
    (14, 3),  # Oscar Lee
    (15, 2),  # Paula Kim
    (16, 1),  # Quinn Brooks
    (17, 3),  # Ryan Scott
    (18, 3),  # Sophie Chen
    (19, 2),  # Tina Rogers
    (20, 1)   # Victor Gray
]


course_data = [
    (1, 'Classical', 1),
    (2, 'Classical', 2),
    (3, 'Classical', 3),
    (4, 'Jazz', 1),
    (5, 'Rock', 3),
    (6, 'Pop', 3),
    (7, 'Blues', 3),
    (8, 'Hip Hop', 2),
    (9, 'Folk', 1),
    (10, 'Country', 2),
    (11, 'Electronic', 3),
    (12, 'Reggae', 1)
]

schedule_data = [
    (11, 4, 1, '10:00:00', 'Monday'),
    (12, 8, 2, '14:00:00', 'Wednesday'),
    (12, 3, 1, '09:00:00', 'Tuesday'),
    (12, 1, 2, '13:00:00', 'Thursday'),
    (15, 2, 3, '11:00:00', 'Friday'),
    (13, 2, 4, '15:00:00', 'Saturday'),
    (13, 2, 5, '12:00:00', 'Monday'),
    (20, 5, 6, '16:00:00', 'Tuesday'),
    (19, 10, 7, '08:00:00', 'Wednesday'),
    (20, 9, 8, '18:00:00', 'Thursday')
]

# Define the SQL queries for each table
sql_person_insert = """
INSERT INTO Person (id, name, phone_number) VALUES (%s, %s, %s)
"""

sql_teacher_insert = """
INSERT INTO Teacher (id, rate) VALUES (%s, %s)
"""

sql_student_insert = """
INSERT INTO Student (id, skill_level) VALUES (%s, %s)
"""

sql_course_insert = """
INSERT INTO Course (courseID, courseName, skillLevel) VALUES (%s, %s, %s)
"""

sql_schedule_insert = """
INSERT INTO Schedule (studentID, teacherID, courseID, MeetingTime, MeetingDay) VALUES (%s, %s, %s, %s, %s)
"""

# Connect to the database and insert the data
with psycopg2.connect(conn_string) as conn:
    cursor = conn.cursor()

    # Insert data into the Person table
    cursor.executemany(sql_person_insert, person_data)

    # Insert data into the Teacher table
    cursor.executemany(sql_teacher_insert, teacher_data)

    # Insert data into the Student table
    cursor.executemany(sql_student_insert, student_data)

    # Insert data into the Course table
    cursor.executemany(sql_course_insert, course_data)

    # Insert data into the Schedule table
    cursor.executemany(sql_schedule_insert, schedule_data)

    # Commit the transaction
    conn.commit()

In [ ]:
def show_table(table_name):
    select = f"select * from {table_name}"
    with psycopg2.connect(conn_string) as conn:
        cursor = conn.cursor()
        cursor.execute(select)
        results = cursor.fetchall()
        for row in results:
            print(row)

In [ ]:
show_table('person')

(1, 'Alice Johnson', '555-1234')
(2, 'Bob Smith', '555-5678')
(3, 'Charlie Davis', '555-8765')
(4, 'Dana White', '555-4321')
(5, 'Evelyn Carter', '555-2468')
(6, 'Frank Thompson', '555-1357')
(7, 'Grace Lee', '555-9876')
(8, 'Hank Miller', '555-6543')
(9, 'Ivy Nguyen', '555-7890')
(10, 'Jack Brown', '555-3210')
(11, 'Lily Adams', '555-4567')
(12, 'Mark Wilson', '555-7654')
(13, 'Nina Patel', '555-2345')
(14, 'Oscar Lee', '555-8760')
(15, 'Paula Kim', '555-1359')
(16, 'Quinn Brooks', '555-2589')
(17, 'Ryan Scott', '555-8521')
(18, 'Sophie Chen', '555-9630')
(19, 'Tina Rogers', '555-1478')
(20, 'Victor Gray', '555-3698')

OpenAI Usage

In [ ]:
import json
from openai import OpenAI
import os
import sqlite3
from time import time

def runSql(query):
  with psycopg2.connect(conn_string) as conn:
        cursor = conn.cursor()
        cursor.execute(query)
        return cursor.fetchall()


# OPENAI
openAiClient = OpenAI(
    api_key = userdata.get("openaiKey"),
    organization = userdata.get("orgId")
)

def getChatGptResponse(content):
    stream = openAiClient.chat.completions.create(
        model="gpt-4o-mini",
        messages=[{"role": "user", "content": content}],
        stream=True,
    )

    responseList = []
    for chunk in stream:
        if chunk.choices[0].delta.content is not None:
            responseList.append(chunk.choices[0].delta.content)

    result = "".join(responseList)
    return result


# strategies
commonSqlOnlyRequest = " Give me a postgre select statement that answers the question. Only respond with postgre syntax. If there is an error do not expalin it!"
strategies = {
    "zero_shot": create_table_sql + commonSqlOnlyRequest,
    "single_domain_double_shot": (
        create_table_sql +
        " Which students are not enrolled in any courses? " +
        "\nSELECT s.id, p.name " +
        "\nFROM student s " +
        "\nJOIN person p ON s.id = p.id " +
        "\nLEFT JOIN schedule sch ON s.id = sch.studentID " +
        "\nWHERE sch.courseID IS NULL;" +
        "\n" + commonSqlOnlyRequest
    )
}

questions = [
    "Which teachers have the most students?",
    "Which students are in multiple classes",
    "Which teacher has the highest rate",
    "How many students are enrolled in each course?",
    "Which courses have no students scheduled?",
    "What is the average rate of teachers?",
    "List all teachers and the courses that they are teaching",
    "What are the names of courses offered for the skill level 1?",
    "What is the average skill level of the students?"
    # "I need insert sql into my tables can you provide good unique data?"
]

def sanitizeForJustSql(value):
    gptStartSqlMarker = "```sql"
    gptEndSqlMarker = "```"
    if gptStartSqlMarker in value:
        value = value.split(gptStartSqlMarker)[1]
    if gptEndSqlMarker in value:
        value = value.split(gptEndSqlMarker)[0]

    return value

for strategy in strategies:
    responses = {"strategy": strategy, "prompt_prefix": strategies[strategy]}
    questionResults = []
    for question in questions:
        print(question)
        error = "None"
        try:
            sqlSyntaxResponse = getChatGptResponse(strategies[strategy] + " " + question)
            sqlSyntaxResponse = sanitizeForJustSql(sqlSyntaxResponse)
            print(sqlSyntaxResponse)
            queryRawResponse = str(runSql(sqlSyntaxResponse))
            print(queryRawResponse)
            friendlyResultsPrompt = "I asked a question \"" + question +"\" and the response was \""+queryRawResponse+"\" Please, just give a concise response in a more friendly way? Please do not give any other suggests or chatter."
            friendlyResponse = getChatGptResponse(friendlyResultsPrompt)
            print(friendlyResponse)
        except Exception as err:
            error = str(err)
            print(err)

        questionResults.append({
            "question": question,
            "sql": sqlSyntaxResponse,
            "queryRawResponse": queryRawResponse,
            "friendlyResponse": friendlyResponse,
            "error": error
        })

    responses["questionResults"] = questionResults

Which teachers have the most students?

SELECT t.id, p.name, COUNT(s.id) AS student_count
FROM Teacher t
JOIN Schedule sch ON t.id = sch.teacherID
JOIN Student s ON sch.studentID = s.id
JOIN Person p ON t.id = p.id
GROUP BY t.id, p.name
ORDER BY student_count DESC;

[(2, 'Bob Smith', 3), (8, 'Hank Miller', 1), (3, 'Charlie Davis', 1), (10, 'Jack Brown', 1), (9, 'Ivy Nguyen', 1), (5, 'Evelyn Carter', 1), (1, 'Alice Johnson', 1), (4, 'Dana White', 1)]
Sure! The teacher with the most students is Bob Smith with 3 students.
Which students are in multiple classes

SELECT s.id, p.name
FROM Student s
JOIN Person p ON s.id = p.id
JOIN Schedule sch ON s.id = sch.studentID
GROUP BY s.id, p.name
HAVING COUNT(sch.courseID) > 1;

[(20, 'Victor Gray'), (12, 'Mark Wilson'), (13, 'Nina Patel')]
The students in multiple classes are Victor Gray, Mark Wilson, and Nina Patel.
Which teacher has the highest rate

SELECT id, rate FROM Teacher ORDER BY rate DESC LIMIT 1;

[(6, Decimal('50.00'))]
The teacher with the highest rating has a score of 50.00.
How many students are enrolled in each course?

SELECT c.courseName, COUNT(s.id) AS enrolled_students
FROM Course c
LEFT JOIN Schedule sch ON c.courseID = sch.courseID
LEFT JOIN Student s ON sch.studentID = s.id
GROUP BY c.courseName;

[('Electronic', 0), ('Country', 0), ('Classical', 5), ('Hip Hop', 1), ('Pop', 1), ('Rock', 1), ('Reggae', 0), ('Blues', 1), ('Folk', 0), ('Jazz', 1)]
Sure! Here's the enrollment for each course:

- Electronic: 0
- Country: 0
- Classical: 5
- Hip Hop: 1
- Pop: 1
- Rock: 1
- Reggae: 0
- Blues: 1
- Folk: 0
- Jazz: 1
Which courses have no students scheduled?

SELECT courseID, courseName
FROM Course
WHERE courseID NOT IN (SELECT DISTINCT courseID FROM Schedule);

[(9, 'Folk'), (10, 'Country'), (11, 'Electronic'), (12, 'Reggae')]
Sure! The courses with no students scheduled are: Folk, Country, Electronic, and Reggae.
What is the average rate of teachers?

SELECT AVG(rate) FROM Teacher;

[(Decimal('40.5800000000000000'),)]
The average rate of teachers is approximately $40.58 per hour.
List all teachers and the courses that they are teaching

SELECT t.id AS teacher_id, p.name AS teacher_name, c.courseName AS course_name
FROM Teacher t
JOIN Person p ON t.id = p.id
JOIN Schedule s ON t.id = s.teacherID
JOIN Course c ON s.courseID = c.courseID;

[(4, 'Dana White', 'Classical'), (8, 'Hank Miller', 'Classical'), (3, 'Charlie Davis', 'Classical'), (1, 'Alice Johnson', 'Classical'), (2, 'Bob Smith', 'Classical'), (2, 'Bob Smith', 'Jazz'), (2, 'Bob Smith', 'Rock'), (5, 'Evelyn Carter', 'Pop'), (10, 'Jack Brown', 'Blues'), (9, 'Ivy Nguyen', 'Hip Hop')]
Sure! Here are the teachers and the courses they're teaching:

- Dana White: Classical
- Hank Miller: Classical
- Charlie Davis: Classical
- Alice Johnson: Classical
- Bob Smith: Classical, Jazz, Rock
- Evelyn Carter: Pop
- Jack Brown: Blues
- Ivy Nguyen: Hip Hop
What are the names of courses offered for the skill level 1?

SELECT courseName
FROM Course
WHERE skillLevel = '1';

[('Classical',), ('Jazz',), ('Folk',), ('Reggae',)]
The courses offered for skill level 1 are: Classical, Jazz, Folk, and Reggae.
What is the average skill level of the students?

SELECT AVG(skill_level) AS average_skill_level FROM Student;

[(Decimal('2.1000000000000000'),)]
The average skill level of the students is approximately 2.1.
Which teachers have the most students?

SELECT t.id, p.name, COUNT(s.id) AS student_count
FROM teacher t
JOIN person p ON t.id = p.id
LEFT JOIN schedule sch ON t.id = sch.teacherID
LEFT JOIN student s ON sch.studentID = s.id
GROUP BY t.id, p.name
ORDER BY student_count DESC
LIMIT 1;

[(2, 'Bob Smith', 3)]
The teacher with the most students is Bob Smith, with 3 students!
Which students are in multiple classes

SELECT s.id, p.name
FROM student s
JOIN person p ON s.id = p.id
JOIN schedule sch ON s.id = sch.studentID
GROUP BY s.id, p.name
HAVING COUNT(sch.courseID) > 1;

[(20, 'Victor Gray'), (12, 'Mark Wilson'), (13, 'Nina Patel')]
Sure! The students in multiple classes are Victor Gray, Mark Wilson, and Nina Patel.
Which teacher has the highest rate

SELECT t.id, p.name, t.rate
FROM teacher t
JOIN person p ON t.id = p.id
ORDER BY t.rate DESC
LIMIT 1;

[(6, 'Frank Thompson', Decimal('50.00'))]
The teacher with the highest rate is Frank Thompson, with a rate of $50.00.
How many students are enrolled in each course?

SELECT c.courseID, c.courseName, COUNT(s.studentID) AS enrolled_count
FROM course c
LEFT JOIN schedule sch ON c.courseID = sch.courseID
LEFT JOIN student s ON sch.studentID = s.id
GROUP BY c.courseID, c.courseName;

column s.studentid does not exist
LINE 2: SELECT c.courseID, c.courseName, COUNT(s.studentID) AS enrol...
                                               ^
HINT:  Perhaps you meant to reference the column "sch.studentid".

Which courses have no students scheduled?

SELECT c.courseID, c.courseName
FROM Course c
LEFT JOIN Schedule sch ON c.courseID = sch.courseID
WHERE sch.studentID IS NULL;

[(11, 'Electronic'), (12, 'Reggae'), (10, 'Country'), (9, 'Folk')]
The courses with no students scheduled are: Electronic, Reggae, Country, and Folk.
What is the average rate of teachers?

SELECT AVG(rate) AS average_rate
FROM Teacher;

[(Decimal('40.5800000000000000'),)]
The average rate of teachers is approximately $40.58 per hour.
List all teachers and the courses that they are teaching

SELECT t.id AS teacher_id, p.name AS teacher_name, c.courseID, c.courseName
FROM teacher t
JOIN person p ON t.id = p.id
JOIN schedule sch ON t.id = sch.teacherID
JOIN course c ON sch.courseID = c.courseID;

[(4, 'Dana White', 1, 'Classical'), (8, 'Hank Miller', 2, 'Classical'), (3, 'Charlie Davis', 1, 'Classical'), (1, 'Alice Johnson', 2, 'Classical'), (2, 'Bob Smith', 3, 'Classical'), (2, 'Bob Smith', 4, 'Jazz'), (2, 'Bob Smith', 5, 'Rock'), (5, 'Evelyn Carter', 6, 'Pop'), (10, 'Jack Brown', 7, 'Blues'), (9, 'Ivy Nguyen', 8, 'Hip Hop')]
Here’s the list of teachers and the courses they are teaching:

- Dana White: Classical
- Hank Miller: Classical
- Charlie Davis: Classical
- Alice Johnson: Classical
- Bob Smith: Classical, Jazz, Rock
- Evelyn Carter: Pop
- Jack Brown: Blues
- Ivy Nguyen: Hip Hop
What are the names of courses offered for the skill level 1?

SELECT courseName
FROM Course
WHERE skillLevel = '1';

[('Classical',), ('Jazz',), ('Folk',), ('Reggae',)]
The courses offered for skill level 1 are: Classical, Jazz, Folk, and Reggae.
What is the average skill level of the students?

SELECT AVG(skill_level) AS average_skill_level
FROM student;

[(Decimal('2.1000000000000000'),)]
The average skill level of the students is 2.1.